app/controllers/user_controller.rb

INSERT INTO "users" ("username", "email", "bio") VALUES (?, ?, ?)  [["username", "dd"], ["email", "dd"], ["bio", "dd"]]
---
  def create
  	@user = User.create username: params[:user][:username], email: params[:user][:email], bio: params[:user][:bio]